const express=require("express");
const bodyparser=require("body-parser");

const app=express();
app.use(bodyparser.urlencoded({extended:true}));


app.get("/",function(req,res){
    res.sendFile(__dirname+"/index.html");
});

app.post("/",function(req,res){
    res.send("sum:"+(num1+num2));
})

app.get("/bmicalculator",function(req,res){
    res.sendFile(__dirname+"/bmiCalculator.html");
})

app.post("/bmicalculator",function(req,res){
    var height=parseFloat((req.body.height));
    var weight=parseFloat((req.body.weight));

    var result=Math.round(weight/(height*height));

    res.send("result of bmi calculator is:"+result);
})

app.listen(3000, function() {
    console.log("Example app listening on port 3000");
  });
  
Καλησπέρα κύριε Μελετίου και χρόνια πολλά

Έχω τελειώσει με τις φοιτητικές μου υποχρεώσεις (μαθήματα και διπλωματική),το τελευταίο μάθημα δεν έχει περαστεί ακόμα στο φοιτητολόγιο βέβαια,
γιατί το έδωσα το Σεπτέμβρη.Αυτήν την περίοδο βρίσκομαι στο στρατό για την θητεία μου και θα ήθελα να μάθω ,αν πρέπει να κάνω υποχρεωτικά δήλωση μαθημάτων,
έστω και κάποια μαθήματα στη τύχη στο σύστημα,για να μην φαίνομαι ανενεργός στην φοιτητική κατάσταση για όσο διάστημα θα λείπω.
Διότι λόγω του στρατού,θα λείπω για τους επόμενους μήνες και θα κάνω αίτηση για τελετή ορκωμοσίας μετά από ένα χρόνο που θα έχω τελειώσει με την θητεία μου και θα
βρίσκομαι στην Αθήνα.
Υπάρχει κίνδυνος αν φαίνεται στο σύστημα ότι δεν θα κάνω δήλωση για τα επόμενα 2 εξάμηνα(χειμερινό 2022 και εαρινό 2023),
αφού δεν έχω κάποιο μάθημα να δώσω,να θεωρούμαι ανενεργός φοιτητής και να δημιουργηθούν προβλήματα;

Ευχαριστώ πολύ και συγγνώμη για την ενόχληση.
Καλό τριήμερο.

Καλησπέρα
Ωραία θα κάνω μία κενή δήλωση τότε για να είμαι σίγουρος και μετά αίτηση για πτυχίο.
Ευχαριστώ για την άμεση ανταπόκριση.
Καλό βράδυ.





Καλησπέρα έχω τελειώσει με τις υποχρεώσεις της σχολής(μαθήματα και διπλωματική),όμως δεν έχει γίνει ακόμα ορκωμοσία για να πάρω το πτυχίο.
Γνωρίζετε πότε θα είναι η επόμενη ορκωμοσία του τμήματος μας? Επίσης μπορώ να λάβω ,μέσα από το φοιτητολόγιο, βεβαίωση περάτωσης σπουδών που να δείχνει ότι έχω τελειώσει,μέχρι να γίνει ορκωμοσία και να έχω το πτυχίο.
Ευχαριστώ.



Ξερει κανεις αν μπορω να παρω βεβαιωση περατωσης σπουδων απο τη γραμματεια για να φαινεται οτι εχω τελειωσει με την σχολη (μαθηματα και διπλωματικη),
μεχρι να κανω ορκωμοσια.
Αν γινεται πρεπει να στειλω μαιλ να το ζητησω ή υπαρχει και στο services κατι τετοιο?













